iarsystems/ewarm-toshiba-example-projects/TMPM4K4/Libraries/CMSIS/startup/iar/startup_TMPM4K4B.s
;/**
; *******************************************************************************
; * @file    startup_TMPM4K4B.s
; * @brief   CMSIS Cortex-M4 Core Device Startup File for the
; *          TOSHIBA 'TMPM4K4B' Device Series
; * @version V1.0.0.0
; * 
; * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
; * 
;  * Copyright(C) Toshiba Electronic Device Solutions Corporation 2024
; *******************************************************************************
; */
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; Cortex-M version
;

                MODULE  ?cstartup

                ;; Forward declaration of sections.
                SECTION CSTACK:DATA:NOROOT(3)

                SECTION .intvec:CODE:NOROOT(2)

                EXTERN  __iar_program_start
                EXTERN  SystemInit
                PUBLIC  __vector_table

                DATA
__vector_table  DCD     sfe(CSTACK)
                DCD     Reset_Handler

                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; External Interrupts
                DCD     INT00_IRQHandler          ; 0:	Interrupt pin 00a/00b
                DCD     INT01_IRQHandler          ; 1:	Interrupt pin 01a/01b
                DCD     INT02_IRQHandler          ; 2:	Interrupt pin 02a/02b
                DCD     INT03_IRQHandler          ; 3:	Interrupt pin 03a/03b
                DCD     INT04_IRQHandler          ; 4:	Interrupt pin 04
                DCD     INT05_IRQHandler          ; 5:	Interrupt pin 05
                DCD     INT06_IRQHandler          ; 6:	Interrupt pin 06
                DCD     INT07_IRQHandler          ; 7:	Interrupt pin 07a/07b
                DCD     INT08_IRQHandler          ; 8:	Interrupt pin 08
                DCD     INT09_IRQHandler          ; 9:	Interrupt pin 09
                DCD     INT10_IRQHandler          ; 10:	Interrupt pin 10
                DCD     0                         ; 11:	Reserved
                DCD     0                         ; 12:	Reserved
                DCD     INTEMG0_IRQHandler        ; 13:	A-PMD ch0 EMG interrupt
                DCD     INTEMG1_IRQHandler        ; 14:	A-PMD ch1 EMG interrupt
                DCD     INTOVV0_IRQHandler        ; 15:	A-PMD ch0 OVV interrupt
                DCD     INTOVV1_IRQHandler        ; 16:	A-PMD ch1 OVV interrupt
                DCD     INTPWM0_IRQHandler        ; 17:	A-PMD ch0 PWM interrupt
                DCD     INTPWM1_IRQHandler        ; 18:	A-PMD ch1 PWM interrupt
                DCD     INTENC00_IRQHandler       ; 19:	A-ENC32 ch0 Encoder input interrupt 0
                DCD     INTENC01_IRQHandler       ; 20:	A-ENC32 ch0 Encoder input interrupt 1
                DCD     INTADAPDA_IRQHandler      ; 21:	ADC unit A PMD trigger interrupt A
                DCD     INTADAPDB_IRQHandler      ; 22:	ADC unit A PMD trigger interrupt B
                DCD     0                         ; 23:	Reserved
                DCD     0                         ; 24:	Reserved
                DCD     0                         ; 25:	Reserved
                DCD     INTADACP0_IRQHandler      ; 26:	ADC unit A Monitor function 0 interrupt
                DCD     INTADACP1_IRQHandler      ; 27:	ADC unit A Monitor function 1 interrupt
                DCD     INTADATRG_IRQHandler      ; 28:	ADC unit A General-purpose trigger interrupt
                DCD     INTADASGL_IRQHandler      ; 29:	ADC unit A Single conversion interrupt
                DCD     INTADACNT_IRQHandler      ; 30:	ADC unit A Continuous conversion interrupt
                DCD     INTSC0RX_IRQHandler       ; 31:	TSPI ch0 Receive interrupt/UART ch0 Reception interrupt
                DCD     INTSC0TX_IRQHandler       ; 32:	TSPI ch0 Transmit interrupt/UART ch0 Transmission interrupt
                DCD     INTSC0ERR_IRQHandler      ; 33:	TSPI ch0 Error interrupt/UART ch0 Error interrupt
                DCD     INTSC1RX_IRQHandler       ; 34:	TSPI ch1 Receive interrupt/UART ch1 Reception interrupt
                DCD     INTSC1TX_IRQHandler       ; 35:	TSPI ch1 Transmit interrupt/UART ch1 Transmission interrupt
                DCD     INTSC1ERR_IRQHandler      ; 36:	TSPI ch1 Error interrupt/UART ch1 Error interrupt
                DCD     INTSC2RX_IRQHandler       ; 37:	TSPI ch2 Receive interrupt/UART ch2 Reception interrupt
                DCD     INTSC2TX_IRQHandler       ; 38:	TSPI ch2 Transmit interrupt/UART ch2 Transmission interrupt
                DCD     INTSC2ERR_IRQHandler      ; 39:	TSPI ch2 Error interrupt/UART ch2 Error interrupt
                DCD     INTSC3RX_IRQHandler       ; 40:	TSPI ch3 Receive interrupt/UART ch3 Reception interrupt
                DCD     INTSC3TX_IRQHandler       ; 41:	TSPI ch3 Transmit interrupt/UART ch3 Transmission interrupt
                DCD     INTSC3ERR_IRQHandler      ; 42:	TSPI ch3 Error interrupt/UART ch3 Error interrupt
                DCD     INTI2C0NST_IRQHandler     ; 43:	I2C ch0 interrupt /EI2C ch0 status interrupt
                DCD     INTI2C0ATX_IRQHandler     ; 44:	I2C ch0 arbitration lost detection interrupt/EI2C ch0 transmit buffer empty interrupt
                DCD     INTI2C0BRX_IRQHandler     ; 45:	I2C ch0 bus free detection interrupt/EI2C ch0 receive buffer full interrupt
                DCD     INTI2C0NA_IRQHandler      ; 46:	I2C ch0 I2C NACK detection interrupt
                DCD     INTT32A00AC_IRQHandler    ; 47:	T32A ch0 timer A/C match, overflow, and underflow
                DCD     INTT32A00ACCAP0_IRQHandler; 48:	T32A ch0 timer A/C capture 0
                DCD     INTT32A00ACCAP1_IRQHandler; 49:	T32A ch0 timer A/C capture 1
                DCD     INTT32A00B_IRQHandler     ; 50:	T32A ch0 timer B match, overflow, and underflow
                DCD     INTT32A00BCAP0_IRQHandler ; 51:	T32A ch0 timer B capture 0
                DCD     INTT32A00BCAP1_IRQHandler ; 52:	T32A ch0 timer B capture 1
                DCD     INTT32A01AC_IRQHandler    ; 53:	T32A ch1 timer A/C match, overflow, and underflow
                DCD     INTT32A01ACCAP0_IRQHandler; 54:	T32A ch1 timer A/C capture 0
                DCD     INTT32A01ACCAP1_IRQHandler; 55:	T32A ch1 timer A/C capture 1
                DCD     INTT32A01B_IRQHandler     ; 56:	T32A ch1 timer B match, overflow, and underflow
                DCD     INTT32A01BCAP0_IRQHandler ; 57:	T32A ch1 timer B capture 0
                DCD     INTT32A01BCAP1_IRQHandler ; 58:	T32A ch1 timer B capture 1
                DCD     INTT32A02AC_IRQHandler    ; 59:	T32A ch2 timer A/C match, overflow, and underflow
                DCD     INTT32A02ACCAP0_IRQHandler; 60:	T32A ch2 timer A/C capture 0
                DCD     INTT32A02ACCAP1_IRQHandler; 61:	T32A ch2 timer A/C capture 1
                DCD     INTT32A02B_IRQHandler     ; 62:	T32A ch2 timer B match, overflow, and underflow
                DCD     INTT32A02BCAP0_IRQHandler ; 63:	T32A ch2 timer B capture 0
                DCD     INTT32A02BCAP1_IRQHandler ; 64:	T32A ch2 timer B capture 1
                DCD     INTT32A03AC_IRQHandler    ; 65:	T32A ch3 timer A/C match, overflow, and underflow
                DCD     INTT32A03ACCAP0_IRQHandler; 66:	T32A ch3 timer A/C capture 0
                DCD     INTT32A03ACCAP1_IRQHandler; 67:	T32A ch3 timer A/C capture 1
                DCD     INTT32A03B_IRQHandler     ; 68:	T32A ch3 timer B match, overflow, and underflow
                DCD     INTT32A03BCAP0_IRQHandler ; 69:	T32A ch3 timer B capture 0
                DCD     INTT32A03BCAP1_IRQHandler ; 70:	T32A ch3 timer B capture 1
                DCD     INTT32A04AC_IRQHandler    ; 71:	T32A ch4 timer A/C match, overflow, and underflow
                DCD     INTT32A04ACCAP0_IRQHandler; 72:	T32A ch4 timer A/C capture 0
                DCD     INTT32A04ACCAP1_IRQHandler; 73:	T32A ch4 timer A/C capture 1
                DCD     INTT32A04B_IRQHandler     ; 74:	T32A ch4 timer B match, overflow, and underflow
                DCD     INTT32A04BCAP0_IRQHandler ; 75:	T32A ch4 timer B capture 0
                DCD     INTT32A04BCAP1_IRQHandler ; 76:	T32A ch4 timer B capture 1
                DCD     INTT32A05AC_IRQHandler    ; 77:	T32A ch5 timer A/C match, overflow, and underflow
                DCD     INTT32A05ACCAP0_IRQHandler; 78:	T32A ch5 timer A/C capture 0
                DCD     INTT32A05ACCAP1_IRQHandler; 79:	T32A ch5 timer A/C capture 1
                DCD     INTT32A05B_IRQHandler     ; 80:	T32A ch5 timer B match, overflow, and underflow
                DCD     INTT32A05BCAP0_IRQHandler ; 81:	T32A ch5 timer B capture 0
                DCD     INTT32A05BCAP1_IRQHandler ; 82:	T32A ch5 timer B capture 1
                DCD     INTPARI_IRQHandler        ; 83:	RAMP RAM Parity interrupt
                DCD     INTDMAATC_IRQHandler      ; 84:	DMAC unit A transmission end interrupt (ch0 to 31)
                DCD     INTDMAAERR_IRQHandler     ; 85:	DMAC unit A transmission error interrupt (ch0 to 31)
                DCD     0                         ; 86:	Reserved
                DCD     INTFLCRDY_IRQHandler      ; 87:	Code FLASH Ready interrupt
                DCD     0                         ; 88:	Reserved
                DCD     INTENC10_IRQHandler       ; 89:	A-ENC32 ch1 Encoder input interrupt 0
                DCD     INTENC11_IRQHandler       ; 90:	A-ENC32 ch1 Encoder input interrupt 1
                DCD     INTADBPDA_IRQHandler      ; 91:	ADC unit B PMD trigger interrupt A
                DCD     INTADBPDB_IRQHandler      ; 92:	ADC unit B PMD trigger interrupt B
                DCD     INTADBCP0_IRQHandler      ; 93:	ADC unit B Monitor function 0 interrupt
                DCD     INTADBCP1_IRQHandler      ; 94:	ADC unit B Monitor function 1 interrupt
                DCD     INTADBTRG_IRQHandler      ; 95:	ADC unit B General-purpose trigger interrupt
                DCD     INTADBSGL_IRQHandler      ; 96:	ADC unit B Single conversion interrupt
                DCD     INTADBCNT_IRQHandler      ; 97:	ADC unit B Continuous conversion interrupt
                DCD     INTADCCMP_IRQHandler      ; 98:	ADC Conversion result compare interrupt
                THUMB
; Dummy Exception Handlers (infinite loops which can be modified)

                PUBWEAK Reset_Handler
                SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__iar_program_start
                BX      R0

                PUBWEAK NMI_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
                B       NMI_Handler

                PUBWEAK HardFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
                B       HardFault_Handler

                PUBWEAK MemManage_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
                B       MemManage_Handler

                PUBWEAK BusFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
                B       BusFault_Handler

